package Lessons.Lesson9;

public class main {
    public static void main(String[] args) {

// Генерация случайных чисел random:
//        int month = 3;
//        String monthString = null;
//        switch (month) {
//            case 1:
//                monthString = "Januare";
//                break;
//            case 2:
//                monthString = "Februale";
//                break;
//            case 3:
//                monthString = "Mart";
//                break;
//            default:
//                monthString = "I don't know";
//        }
//        System.out.println(monthString);
//
////        Генерация чисел в заданом диапазоне за формулой:
////        Math.random() * (b-a))+a =>Math.random() * результат;
//        double a = Math.random();
//        double b = Math.random() * 3;
//        System.out.println(b);
//
//        int m = (int) (Math.random() * 3);
//        System.out.println(m);
//
////       Method split:
//        String text = " Hi my name Yuliia";
//        String[] words = text.trim().split(" ");
//        for (String word : words) {
//            System.out.println(word);
//            System.out.println(words.length);
    }
//        Написать програму в которой создается целочисленный массив из 8 случайных чисел из диапазона (0;99)
//        и выводит максимальный элемент массива  в консоль.

//    public static void arrMax() {
//        int max = 0;
//        int[] array = new int[8];
//        for (int i = 0; i < array.length; i++) {
//            array[i] = (int) (Math.random() * 100);
//            System.out.print(array[i] + " ");
//            if (array[i] > max) {
//                max = array[i];
//            }
//            System.out.println();
//            System.out.println(max);
//            }
//        Написать програму в которой предоагается ввести в консоль текст--создать массив
//        и записать  каждое слово в отдельный элемент массива--вывести консоль в строку
//        из элементов массива в обратном порялке используя формулу (n-i-1)/
//        Каждое действие должно выполнится в отдельном методе

}
