package Lessons.Lesson4;

public class main {
    public static void main(String[] args) {
//        System.out.println(" Введите число 12,23,35: ");
//        Scanner scanner = new Scanner(System.in);
//        int number = scanner.nextInt();

//        Task 4 = Необходимо написать программу, где бы пользователю предлагалось ввести число на выбор: 1, 2 или 3, а программа должна сказать, какое число ввёл пользователь: 1, 2, или 3 и в том случаи, если пользователь ввёл какое-либо другое число программа должна отвечать „Вы ввели число не равное 1, 2 или 3“
//
//        if(number == 1){
//            System.out.println("Вы ввели число 12");
//        } else if(number == 2) {
//            System.out.println("Вы ввели число 24");
//        } else if(number == 3) {
//            System.out.println("Вы ввели число 35");
//        } else {
//            System.out.println("Вы ввели неверное число");
//        }

//        switch(number){
//            case 12:
//                System.out.println("Вы ввели число 12");
//                break;
//            case 24:
//                System.out.println("Вы ввели число 24");
//                break;
//            case 35:
//                System.out.println("Вы ввели число 35");
//                break;
//            default:
//                System.out.println("Вы ввели неверное число");
//        }
//
//        String[] array2 = {"Hello", "World"};
//        int[] array1 = {1, 2, 3, 4};
//
//        int arrayLenght = array2.length;
//        System.out.println(array2.length);


        int i = 7;
        while (i <= 7){
            System.out.println("reverse :" + i);
            i += 7;
    }

//
//            int i = 100;
//            while (i >= 10) {
//                System.out.println("reverse : " + i);
//                i -= 10;
//             }



//        int i = 1;
//        do {
//            i++;
//            System.out.println(i);
//        } while (i < 8);
//
//        for (int i = 1; i < 5; i++) {
//            System.out.println(i + " итерация цикла " + "Yulia");
//        }

//        for (int i = 3; i >= -3; i++) {
//            System.out.println(i + " ");
//        }


    }
}
